Enums/ОбъектыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ОбъектыУчета</Name>
			<Comment>Трейд Софт</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорыКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиПоДоговорам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДолговыеОбязательства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительныеДокументы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Залоги</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Mandarin_Действия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>Mandarin_Действия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОдностадийныйПлатеж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаТранзакции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Токен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РекуррентныйПлатеж</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ДолговыеОбязательства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ДолговыеОбязательства</Name>
			<Comment>Трейд Софт</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДолговогоОбязательства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыДолговыхОбязательств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кредитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецДоговор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецДолжник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКонтрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКредитор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецУслуга</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКонтрагента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/ФормаОтправкиEmailизКарточки/Ext/Form/Module.bsl
&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть()
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЭтаФорма.ВладелецФормы.ИмяФормы = "Обработка.MandarinОперации.Форма.Форма" Тогда
		ОбработатьОткрытиеMandarinОперации(ЭтаФорма.ВладелецФормы.Объект.ЕмаилПлательщика,ЭтаФорма.ВладелецФормы.Объект.ВидЗаказа,ЭтаФорма.ВладелецФормы.Объект.СсылкаДляПлательщика,ЭтаФорма.ВладелецФормы.Объект.ОбъектУчета);
	Иначе
		ПриОткрытииСервер(ЭтаФорма.ВладелецФормы.ИмяФормы,ЭтаФорма.ВладелецФормы.Должник,ЭтаФорма.ВладелецФормы.Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииСервер(ИмяФормыВладельца,Должник,ДО)
	ЕмаилКонст = ОбъектыСервер.ПолучитьЗначениеКонстанты("EmailАдресДолжника");	
	Если ИмяФормыВладельца = "Справочник.ДолговыеОбязательства.Форма.ФормаЭлемента" Тогда
		Если ЕмаилКонст.СправочникВладелец.ИмяПредопределенныхДанных = "Справочник_Контрагенты" Тогда
			EmailПолучателя = ОбъектыСервер.ПолучитьЗначениеСвойства(Должник,ЕмаилКонст.Код);
		ИначеЕсли ЕмаилКонст.СправочникВладелец.ИмяПредопределенныхДанных = "Справочник_ДолговыеОбязательства" Тогда
			EmailПолучателя = ОбъектыСервер.ПолучитьЗначениеСвойства(ДО,ЕмаилКонст.Код);
		КонецЕсли;			
	КонецЕсли;	
	УчетнаяЗаписьРассылки = ОбъектыСервер.ПолучитьЗначениеКонстанты("УчеткаEMailРассылок");
	
	ШаблонПисьма = ОбъектыСервер.ПолучитьЗначениеКонстанты("ШаблонПисьмаEmail");
	Если ШаблонПисьма.ОбъектУчета = Перечисления.ОбъектыУчета.ДолговыеОбязательства Тогда
		ТекстПисьма = Автоинформирование.ПолучитьПодсказку(ДО,ШаблонПисьма);
	ИначеЕсли
		 ШаблонПисьма.ОбъектУчета = Перечисления.ОбъектыУчета.Контрагенты Тогда
		 ТекстПисьма = Автоинформирование.ПолучитьПодсказку(Должник,ШаблонПисьма);
	Иначе
		ТекстПисьма = "";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработатьОткрытиеMandarinОперации(Емаил,ВидЗаказа,СсылкаДляПлательщика,ОбъектУчета)
	УчетнаяЗаписьРассылки = ОбъектыСервер.ПолучитьЗначениеКонстанты("УчеткаEMailРассылок");
	EmailПолучателя = Емаил;
	ШаблонПисьма = ?(ВидЗаказа = Перечисления.Mandarin_Действия.Токен,ОбъектыСервер.ПолучитьЗначениеКонстанты("MandarinШаблонТекстаТокен"),ОбъектыСервер.ПолучитьЗначениеКонстанты("MandarinШаблонТекстаОплата"));
	ТекстПисьма = Автоинформирование.ПолучитьПодсказку(ОбъектУчета,ШаблонПисьма);
	ТекстПисьма = ТекстПисьма + Строка(СсылкаДляПлательщика);
КонецПроцедуры


&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьСервер(УчетнаяЗаписьРассылки,EmailПолучателя,ТекстПисьма,ШаблонПисьма,ЭтаФорма.ВладелецФормы.Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ОтправитьСервер(УчетнаяЗапись,ЕмаилКуда,Текст,Шаблон,Об)
	Рассылка.ОтправитьЕмаилПоДО(УчетнаяЗапись,ЕмаилКуда,Текст,Шаблон,Об);
КонецПроцедуры
